{
  "login": "Login",
  "register": "Register",
  "logout": "Logout",
  "welcome": "Welcome",
  "username": "Username",
  "password": "Password",
  "submit": "Submit",
  "login_success": "Login successful!",
  "register_success": "Registration successful, please login!",
  "network_error": "Network error",
  "required_username": "Please enter username",
  "required_password": "Please enter password",
  "chinese": "Chinese",
  "english": "English",
  "solarTerms": {
    "dateLabel": "Date:",
    "solarTermLabel": "Solar Term:",
    "suggestionLabel": "Suggestions:",
    "liChun": "Start of Spring",
    "yuShui": "Rain Water",
    "jingZhe": "Awakening of Insects",
    "chunFen": "Spring Equinox",
    "qingMing": "Clear and Bright",
    "guYu": "Grain Rain",
    "liXia": "Start of Summer",
    "xiaoMan": "Grain Full",
    "mangZhong": "Grain in Ear",
    "xiaZhi": "Summer Solstice",
    "xiaoShu": "Minor Heat",
    "daShu": "Major Heat",
    "liQiu": "Start of Autumn",
    "chuShu": "End of Heat",
    "baiLu": "White Dew",
    "qiuFen": "Autumn Equinox",
    "hanLu": "Cold Dew",
    "shuangJiang": "Frost Descent",
    "liDong": "Start of Winter",
    "xiaoXue": "Minor Snow",
    "daXue": "Major Snow",
    "dongZhi": "Winter Solstice",
    "xiaoHan": "Minor Cold",
    "daHan": "Major Cold"
  },
  "solarTermAdvice": {
    "liChun": "Early spring dressing: three-layer method (thermal underwear + cardigan + windbreaker). Diet focuses on pungent warmth to lift yang, recommend chive-shrimp spring rolls with ginger-jujube-longan tea. Open windows for 15 minutes at noon for air exchange. Practice Eight Brocades outdoors to boost yang, carry touchscreen gloves.",
    "yuShui": "Rainy season: waterproof jacket with wool liner. Diet targets spleen health and dampness removal - brew chicken soup with herbs. Use dehumidifier bags in wardrobe. Wear anti-slip hiking boots and carry folding umbrella. Weekend light hiking recommended.",
    "jingZhe": "Transition season: onion-style dressing (shirt + vest + trench). Diet clears liver and eyes - recommend goji sprouts salad with chrysanthemum tea. Use anti-mite cleaner for bedding. Wear pollen masks for outdoor tai chi. Office workers: use wrist pads.",
    "chunFen": "Temperature fluctuations: removable-liner jacket recommended. Seasonal dish: scrambled eggs with Chinese toon. Adjust curtain opacity for quality sleep. Carry portable picnic mat and UV-blocking sunglasses during outings. Allergy sufferers: take antihistamines in advance.",
    "qingMing": "Rainy travel: quick-dry pants with waterproof boots. Traditional food: mugwort rice dumplings with pu-erh tea to aid digestion. Place activated charcoal dehumidifier at entrance. Carry multifunctional whistle and portable raincoat for tomb sweeping. Change socks after outdoor activities.",
    "guYu": "Late spring: breathable linen shirts with sun sleeves. Recommend purslane salad with corn silk tea. Use anti-dustmite bedding. Wear leech-proof socks for farming. Place snake plant in study for air purification. Keep quick-dry towel in commuter bag.",
    "liXia": "Early summer: cool silk sun-protective clothing. Beat heat with homemade Three Bean Drink. Use rattan mat with cooling gel pillow. Avoid direct noon sun. Outdoor workers: wear cooling neck rings. Replace electrolytes after exercise.",
    "xiaoMan": "Humid heat: wear bamboo fiber underwear for breathability. Recommend bitter chrysanthemum salad with winter melon tea. Maintain 45-55% humidity with dehumidifier. Farming: wear cut-resistant gloves and goggles. Carry anti-mold charcoal in rainy season.",
    "mangZhong": "Busy farming season: dry-fit T-shirt with breathable waist-support pants. High-energy food: beef-rice balls with salted lemon water. Place mint plants to repel mosquitoes. Use cooling vest for harvesting. Office workers: lumbar support cushions.",
    "xiaZhi": "Midsummer: silver-ion quick-dry T-shirt. Cooling snacks: bayberry-lychee drink with water shield salad. Install reflective curtains for west-facing rooms. Carry cooling towel and UV sleeves for noon outings. Wear anti-glare sunglasses when driving.",
    "xiaoShu": "Hot period: linen Hanfu with woven sunhat. Healthy diet: lotus seed congee with sour plum drink. Use humidifier in AC rooms. Wear cooling vests outdoors. Carry mini misting fan and essential oils.",
    "daShu": "Extreme heat: cooling-tech sportswear. Consume winter melon soup with electrolyte tablets. Use water-cooled mattress for sleep. Carry instant cold packs and UV face shields. Avoid strenuous activities during peak heat.",
    "liQiu": "Summer-autumn transition: silk pajamas and mulberry eye mask. Dryness relief: almond milk with pear paste. Use cedar blocks in wardrobe for moth prevention. Hiking: wear ankle-support shoes. Gradually reduce cold drinks.",
    "chuShu": "Remaining heat phase: cotton-linen blend pants. Health recommendation: duck soup with dendrobium and fermented rice balls. Prepare heating systems. Wear heart rate monitor for morning runs. Increase intake of squash and yam.",
    "baiLu": "Noticeable autumn coolness: corduroy jacket and ankle boots. Lung-moistening: steamed pear with fritillary bulb and fungus soup. Switch to brushed cotton bedding. Wear reflective gear for night runs. Allergic rhinitis patients: wear masks.",
    "qiuFen": "Equal day-night duration: knitted cardigan with silk scarf. Seasonal dish: braised chicken with chestnuts and honey pomelo tea. Professional cleaning before floor heating. Wear windproof goggles when cycling. Stock up on nuts.",
    "hanLu": "Deep autumn: cashmere coat with leather gloves. Warming nourishment: mutton soup with angelica and longan tea. Install anti-slip mats in bathroom. Carry foldable cushion for hiking. Wear enclosed slippers at home.",
    "shuangJiang": "Early winter transition: down jacket with shell. Nutritious: ginseng chicken soup with black sesame paste. Install heated toilet seat cover. Adjust exercise time to after sunrise. Change vehicle wiper fluid to antifreeze.",
    "liDong": "Winter clothing: aerogel thermal underwear. High-calorie foods: ginger duck soup with longan-red date tea. Check/replace window seals. Skiing: wear electric-heated gloves. Start making tonic wines.",
    "xiaoXue": "Damp cold period: graphene heating vest. Warmth-promoting: chicken with sesame oil and fermented rice. Use defogger mirror in bathroom. Wear ice cleats over shoes for snow. Place water-grown hyacinths for humidity.",
    "daXue": "Severe cold: down parka. High energy: beef hot pot with sorghum liquor. Use intelligent electric blanket. Vehicles require anti-slip chains. Daily Vitamin D supplements.",
    "dongZhi": "Midwinter: camel hair knee pads and snow boots. Traditional nourishment: lamb stew with eight-treasure porridge. Use air fryer for nuts. Foot soak temperature <45°C. Follow sunlight patterns for sleep.",
    "xiaoHan": "Deep winter: mink hat with heated socks. Fight cold: tonic soup and ginger milk. Diffuse cinnamon oil with ultrasonic humidifier. Delay morning exercise till sufficient sunlight. Pre-warm car engines.",
    "daHan": "Year-end: electric heated jacket. Warming nourishment: Buddha Jumps Over The Wall with rice wine. Use smart frost-free fridge for festival goods. Buy non-slip shoes for elders. Wear dust masks for cleaning. Maintain ventilation during tea ceremonies to prevent CO poisoning."
  }
}